Repository: zziri/cmux
Catalog: Resources/Localizable.xcstrings
Source language: en
Languages: ar, bs, da, de, es, fr, it, ja, ko, nb, pl, pt_br, ru, th, tr, uk, zh_hans, zh_hant

# socket.comments.missingRepoRoot
source: A repository path is required.
ar: مطلوب مسار مستودع.
bs: Potrebna je putanja repozitorija.
da: Der kræves en repository-sti.
de: Ein Repository-Pfad ist erforderlich.
es: Se requiere una ruta de repositorio.
fr: Un chemin de dépôt est requis.
it: È necessario un percorso di repository.
ja: リポジトリのパスを指定してください。
ko: 저장소 경로가 필요합니다.
nb: En repositorybane er påkrevd.
pl: Wymagana jest ścieżka repozytorium.
pt_br: É necessário um caminho de repositório.
ru: Требуется путь к репозиторию.
th: ต้องระบุพาธของที่เก็บโค้ด
tr: Bir depo yolu gerekli.
uk: Потрібен шлях до репозиторію.
zh_hans: 需要提供仓库路径。
zh_hant: 需要提供儲存庫路徑。

# socket.notification.clear.callerSelectorsRequireCaller
source: caller-only selectors require caller=true
ar: تتطلب محددات caller استخدام caller=true
bs: Caller selektori zahtijevaju caller=true
da: Caller-selektorer kræver caller=true
de: Caller-Selektoren erfordern caller=true
es: Los selectores exclusivos de caller requieren caller=true
fr: Les sélecteurs caller nécessitent caller=true
it: I selettori solo caller richiedono caller=true
ja: caller 専用セレクターには caller=true が必要です
ko: caller 전용 선택자는 caller=true가 필요합니다
nb: Caller-selektorer krever caller=true
pl: Selektory caller wymagają caller=true
pt_br: Os seletores exclusivos de caller exigem caller=true
ru: Для селекторов caller требуется caller=true
th: ตัวเลือก caller ต้องใช้ caller=true
tr: caller seçicileri caller=true gerektirir
uk: Селектори caller потребують caller=true
zh_hans: 仅 caller 选择器需要 caller=true
zh_hant: 僅 caller 選取器需要 caller=true

# socket.notification.clear.callerInvalid
source: Missing or invalid caller
ar: caller مفقود أو غير صالح
bs: Caller nedostaje ili je nevažeći
da: Caller mangler eller er ugyldig
de: Caller fehlt oder ist ungültig
es: Falta caller o no es válido
fr: Caller manquant ou invalide
it: Caller mancante o non valido
ja: caller が指定されていないか無効です
ko: caller가 없거나 유효하지 않습니다
nb: Caller mangler eller er ugyldig
pl: Brak caller lub nieprawidłowy caller
pt_br: caller ausente ou inválido
ru: Параметр caller отсутствует или недействителен
th: ไม่มี caller หรือ caller ไม่ถูกต้อง
tr: caller eksik veya geçersiz
uk: Параметр caller відсутній або недійсний
zh_hans: caller 缺失或无效
zh_hant: caller 遺失或無效

# socket.notification.clear.callerScopeConflict
source: caller clear cannot be combined with workspace_id, tab_id, or surface_id
ar: لا يمكن الجمع بين مسح caller و workspace_id أو tab_id أو surface_id
bs: Caller clear ne može se kombinovati s workspace_id, tab_id ili surface_id
da: Caller-clear kan ikke kombineres med workspace_id, tab_id eller surface_id
de: Caller-Löschung kann nicht mit workspace_id, tab_id oder surface_id kombiniert werden
es: caller clear no puede combinarse con workspace_id, tab_id o surface_id
fr: caller clear ne peut pas être combiné avec workspace_id, tab_id ou surface_id
it: caller clear non può essere combinato con workspace_id, tab_id o surface_id
ja: caller の消去は workspace_id、tab_id、または surface_id と併用できません
ko: caller clear는 workspace_id, tab_id 또는 surface_id와 함께 사용할 수 없습니다
nb: Caller-clear kan ikke kombineres med workspace_id, tab_id eller surface_id
pl: caller clear nie może być łączony z workspace_id, tab_id ani surface_id
pt_br: caller clear não pode ser combinado com workspace_id, tab_id ou surface_id
ru: Очистку caller нельзя сочетать с workspace_id, tab_id или surface_id
th: ไม่สามารถใช้ caller clear ร่วมกับ workspace_id, tab_id หรือ surface_id ได้
tr: caller clear, workspace_id, tab_id veya surface_id ile birleştirilemez
uk: Очищення caller не можна поєднувати з workspace_id, tab_id або surface_id
zh_hans: caller clear 不能与 workspace_id、tab_id 或 surface_id 一起使用
zh_hant: caller clear 不可與 workspace_id、tab_id 或 surface_id 搭配

# socket.notification.clear.preferredWorkspaceIdInvalid
source: Missing or invalid preferred_workspace_id
ar: preferred_workspace_id مفقود أو غير صالح
bs: preferred_workspace_id nedostaje ili je nevažeći
da: preferred_workspace_id mangler eller er ugyldig
de: preferred_workspace_id fehlt oder ist ungültig
es: Falta preferred_workspace_id o no es válido
fr: preferred_workspace_id manquant ou invalide
it: preferred_workspace_id mancante o non valido
ja: preferred_workspace_id が指定されていないか無効です
ko: preferred_workspace_id가 없거나 유효하지 않습니다
nb: preferred_workspace_id mangler eller er ugyldig
pl: Brak lub nieprawidłowy preferred_workspace_id
pt_br: preferred_workspace_id ausente ou inválido
ru: preferred_workspace_id отсутствует или недействителен
th: ไม่มี preferred_workspace_id หรือไม่ถูกต้อง
tr: preferred_workspace_id eksik veya geçersiz
uk: preferred_workspace_id відсутній або недійсний
zh_hans: preferred_workspace_id 缺失或无效
zh_hant: preferred_workspace_id 遺失或無效

# socket.notification.clear.preferredSurfaceIdInvalid
source: Missing or invalid preferred_surface_id
ar: preferred_surface_id مفقود أو غير صالح
bs: preferred_surface_id nedostaje ili je nevažeći
da: preferred_surface_id mangler eller er ugyldigt
de: preferred_surface_id fehlt oder ist ungültig
es: Falta preferred_surface_id o no es válido
fr: preferred_surface_id manquant ou invalide
it: preferred_surface_id mancante o non valido
ja: preferred_surface_id が指定されていないか無効です
ko: preferred_surface_id가 없거나 유효하지 않습니다
nb: preferred_surface_id mangler eller er ugyldig
pl: Brak lub nieprawidłowy preferred_surface_id
pt_br: preferred_surface_id ausente ou inválido
ru: preferred_surface_id отсутствует или недействителен
th: ไม่มี preferred_surface_id หรือไม่ถูกต้อง
tr: preferred_surface_id eksik veya geçersiz
uk: preferred_surface_id відсутній або недійсний
zh_hans: preferred_surface_id 缺失或无效
zh_hant: preferred_surface_id 遺失或無效

# socket.notification.clear.surfaceIdRequiresWorkspace
source: surface_id requires workspace_id
ar: surface_id يتطلب workspace_id
bs: surface_id zahtijeva workspace_id
da: surface_id kræver workspace_id
de: surface_id erfordert workspace_id
es: surface_id requiere workspace_id
fr: surface_id nécessite workspace_id
it: surface_id richiede workspace_id
ja: surface_id には workspace_id が必要です
ko: surface_id에는 workspace_id가 필요합니다
nb: surface_id krever workspace_id
pl: surface_id wymaga workspace_id
pt_br: surface_id exige workspace_id
ru: Для surface_id требуется workspace_id
th: surface_id ต้องมี workspace_id
tr: surface_id workspace_id gerektirir
uk: Для surface_id потрібен workspace_id
zh_hans: surface_id 需要 workspace_id
zh_hant: surface_id 需要 workspace_id

# socket.notification.clear.workspaceIdInvalid
source: Missing or invalid workspace_id
ar: workspace_id مفقود أو غير صالح
bs: workspace_id nedostaje ili je nevažeći
da: workspace_id mangler eller er ugyldigt
de: workspace_id fehlt oder ist ungültig
es: Falta workspace_id o no es válido
fr: workspace_id manquant ou invalide
it: workspace_id mancante o non valido
ja: workspace_id が指定されていないか無効です
ko: workspace_id가 없거나 유효하지 않습니다
nb: workspace_id mangler eller er ugyldig
pl: Brak lub nieprawidłowy workspace_id
pt_br: workspace_id ausente ou inválido
ru: workspace_id отсутствует или недействителен
th: ไม่มี workspace_id หรือไม่ถูกต้อง
tr: workspace_id eksik veya geçersiz
uk: workspace_id відсутній або недійсний
zh_hans: workspace_id 缺失或无效
zh_hant: workspace_id 遺失或無效

# socket.notification.clear.unavailable
source: Notifications are unavailable. Try again.
ar: الإشعارات غير متاحة. حاول مرة أخرى.
bs: Obavijesti nisu dostupne. Pokušajte ponovo.
da: Notifikationer er ikke tilgængelige. Prøv igen.
de: Benachrichtigungen sind nicht verfügbar. Versuche es erneut.
es: Las notificaciones no están disponibles. Inténtalo de nuevo.
fr: Les notifications sont indisponibles. Réessayez.
it: Le notifiche non sono disponibili. Riprova.
ja: 通知を利用できません。もう一度お試しください。
ko: 알림을 사용할 수 없습니다. 다시 시도해 주세요.
nb: Varsler er ikke tilgjengelige. Prøv igjen.
pl: Powiadomienia są niedostępne. Spróbuj ponownie.
pt_br: As notificações estão indisponíveis. Tente novamente.
ru: Уведомления недоступны. Повторите попытку.
th: ไม่สามารถใช้การแจ้งเตือนได้ โปรดลองอีกครั้ง
tr: Bildirimler kullanılamıyor. Tekrar deneyin.
uk: Сповіщення недоступні. Спробуйте ще раз.
zh_hans: 通知不可用。请重试。
zh_hant: 通知無法使用。請再試一次。

# socket.notification.dismissSelectorRequired
source: Select exactly one of id or all_read
ar: حدد واحداً فقط من id أو all_read
de: Wähle genau eines von id oder all_read aus
es: Seleccione exactamente uno de id o all_read
fr: Sélectionnez exactement id ou all_read
ja: id または all_read のどちらか一つだけを選択してください
ko: id 또는 all_read 중 정확히 하나만 선택하십시오
zh_hans: 必须且只能选择 id 或 all_read 之一
zh_hant: 請恰好選擇 id 或 all_read 其中之一

# socket.notification.idRequired
source: Missing or invalid notification id
ar: معرّف الإشعار مفقود أو غير صالح
de: Fehlende oder ungültige Benachrichtigungs-ID
es: ID de notificación faltante o no válido
fr: ID de notification manquant ou invalide
ja: 通知 ID が指定されていないか無効です
ko: 알림 ID가 없거나 잘못되었습니다
zh_hans: 通知 id 缺失或无效
zh_hant: 遺失或無效的通知 ID

# socket.notification.markReadSelectorRequired
source: Select exactly one of id, tab_id, or all
ar: حدد واحداً فقط من id أو tab_id أو all
de: Wähle genau eines von id, tab_id oder all aus
es: Seleccione exactamente uno de id, tab_id o all
fr: Sélectionnez exactement id, tab_id ou all
ja: id、tab_id、all のいずれか一つだけを選択してください
ko: id, tab_id, all 중 정확히 하나만 선택하십시오
zh_hans: 必须且只能选择 id、tab_id 或 all 之一
zh_hant: 必須選擇 id、tab_id 或 all 其中之一

# socket.notification.notFound
source: Notification not found
ar: لم يتم العثور على الإشعار
de: Benachrichtigung nicht gefunden
es: Notificación no encontrada
fr: Notification introuvable
ja: 通知が見つかりません
ko: 알림을 찾을 수 없습니다
zh_hans: 未找到通知
zh_hant: 找不到通知

# socket.notification.surfaceIdInvalid
source: Missing or invalid surface_id
ar: معرّف surface_id مفقود أو غير صالح
de: Fehlende oder ungültige surface_id
es: surface_id faltante o no válido
fr: surface_id manquant ou invalide
ja: surface_id が指定されていないか無効です
ko: surface_id가 없거나 잘못되었습니다
zh_hans: surface_id 缺失或无效
zh_hant: 遺失或無效的 surface_id

# socket.notification.surfaceIdRequiresWorkspace
source: surface_id requires tab_id or workspace_id
ar: يتطلب surface_id توفير tab_id أو workspace_id
de: surface_id erfordert tab_id oder workspace_id
es: surface_id requiere tab_id o workspace_id
fr: surface_id requiert tab_id ou workspace_id
ja: surface_id には tab_id または workspace_id が必要です
ko: surface_id에는 tab_id 또는 workspace_id가 필요합니다
zh_hans: surface_id 需要配合 tab_id 或 workspace_id 使用
zh_hant: surface_id 需要 tab_id 或 workspace_id

# socket.notification.targetNotFound
source: Notification target not found
ar: لم يتم العثور على هدف الإشعار
de: Benachrichtigungsziel nicht gefunden
es: Destino de notificación no encontrado
fr: Cible de la notification introuvable
ja: 通知の移動先が見つかりません
ko: 알림 대상을 찾을 수 없습니다
zh_hans: 未找到通知目标
zh_hant: 找不到通知目標

# socket.pane.error.surfaceNotFound
source: Surface not found
ar: لم يتم العثور على السطح
bs: Površina nije pronađena
da: Overflade blev ikke fundet
de: Oberfläche nicht gefunden
es: No se encontró la superficie
fr: Surface introuvable
it: Superficie non trovata
ja: サーフェスが見つかりません
ko: 서피스를 찾을 수 없습니다
nb: Fant ikke overflate
pl: Nie znaleziono powierzchni
pt_br: Superfície não encontrada
ru: Поверхность не найдена
th: ไม่พบพื้นผิว
tr: Yüzey bulunamadı
uk: Поверхню не знайдено
zh_hans: 未找到表面
zh_hant: 找不到介面

# socket.pane.resize.invalidParameters
source: Invalid pane resize parameters
ar: معلمات تغيير حجم الجزء غير صالحة
de: Ungültige Parameter für die Teilfenster-Größenänderung
es: Parámetros de cambio de tamaño del panel no válidos
fr: Paramètres de redimensionnement du volet invalides
ja: ペインのサイズ変更パラメータが無効です
ko: 분할 창 크기 조정 매개변수가 잘못되었습니다
zh_hans: 窗格尺寸调整参数无效
zh_hant: 無效的窗格調整大小參數

# socket.pane.resize.localMetricsUnavailable
source: Pane resize metrics are not ready; wait for the pane to finish loading and retry.
ar: مقاييس تغيير حجم الجزء ليست جاهزة بعد؛ انتظر حتى ينتهي الجزء من التحميل وأعد المحاولة.
de: Metriken für die Teilfenster-Größenänderung sind nicht bereit; warte, bis das Teilfenster vollständig geladen ist, und versuche es erneut.
es: Las métricas de cambio de tamaño del panel no están listas; espere a que el panel termine de cargarse y vuelva a intentarlo.
fr: Les mesures de redimensionnement du volet ne sont pas prêtes ; attendez la fin du chargement du volet et réessayez.
ja: ペインのサイズ変更メトリクスの準備ができていません。ペインの読み込みが完了してからもう一度お試しください。
ko: 분할 창 크기 조정 메트릭이 준비되지 않았습니다. 분할 창 로드가 완료될 때까지 기다린 후 다시 시도하십시오.
zh_hans: 窗格尺寸调整所需的度量尚未就绪；请等待窗格加载完成后重试。
zh_hant: 窗格調整大小指標尚未就緒；請等待窗格載入完成後重試。

# socket.pane.resize.remoteUnavailable
source: The remote tmux pane is not ready to resize; wait for it to become available and retry.
ar: جزء tmux البعيد ليس جاهزاً لتغيير الحجم؛ انتظر حتى يصبح متاحاً وأعد المحاولة.
de: Das Remote-tmux-Teilfenster ist nicht bereit für eine Größenänderung; warte, bis es verfügbar ist, und versuche es erneut.
es: El panel remoto de tmux no está listo para cambiar de tamaño; espere a que esté disponible y vuelva a intentarlo.
fr: Le volet tmux distant n'est pas prêt à être redimensionné ; attendez qu'il soit disponible et réessayez.
ja: リモート tmux ペインのサイズを変更する準備ができていません。利用可能になってからもう一度お試しください。
ko: 원격 tmux 분할 창의 크기를 조정할 준비가 되지 않았습니다. 사용 가능해질 때까지 기다린 후 다시 시도하십시오.
zh_hans: 远程 tmux 窗格尚不能调整尺寸；请等待其可用后重试。
zh_hant: 遠端 tmux 窗格尚未準備好調整大小；請等待其可用後重試。

# socket.remoteTmux.disabled
source: remote tmux beta is disabled
ar: النسخة التجريبية من tmux البعيد معطلة
de: Remote-tmux-Beta ist deaktiviert
es: la versión beta de tmux remoto está desactivada
fr: la version bêta de tmux distant est désactivée
ja: リモート tmux ベータは無効です
ko: 원격 tmux 베타 기능이 비활성화되어 있습니다
zh_hans: 远程 tmux 测试版功能已停用
zh_hant: 遠端 tmux 測試版已停用

# socket.remoteTmux.hostAndSessionRequired
source: host and session are required
ar: المضِيف والجلسة مطلوبان
de: host und session sind erforderlich
es: se requieren host y session
fr: l'hôte et la session sont requis
ja: ホストとセッションが必要です
ko: host 및 session이 필요합니다
zh_hans: 必须提供 host 和 session
zh_hant: 必須提供 host 與 session

# socket.remoteTmux.hostRequired
source: host is required
ar: المضيف مطلوب
de: host ist erforderlich
es: se requiere host
fr: l'hôte est requis
ja: ホストが必要です
ko: host가 필요합니다
zh_hans: 必须提供 host
zh_hant: 必須提供 host

# socket.remoteTmux.sessionRequired
source: session is required
ar: الجلسة مطلوبة
de: session ist erforderlich
es: se requiere session
fr: la session est requise
ja: セッションが必要です
ko: session이 필요합니다
zh_hans: 必须提供 session
zh_hant: 必須提供 session

# socket.sidebar.custom.invalidName
source: Sidebar name must not be empty.
ar: يجب ألا يكون اسم الشريط الجانبي فارغاً.
de: Der Name der Seitenleiste darf nicht leer sein.
es: El nombre de la barra lateral no debe estar vacío.
fr: Le nom de la barre latérale ne doit pas être vide.
ja: サイドバー名は空にできません。
ko: 사이드바 이름은 비워 둘 수 없습니다.
zh_hans: 侧边栏名称不能为空。
zh_hant: 側邊欄名稱不能為空。

# socket.sidebar.custom.missing
source: Sidebar file is missing.
ar: ملف الشريط الجانبي مفقود.
de: Seitenleisten-Datei fehlt.
es: Falta el archivo de la barra lateral.
fr: Le fichier de la barre latérale est manquant.
ja: サイドバーファイルが見つかりません。
ko: 사이드바 파일이 누락되었습니다.
zh_hans: 侧边栏文件缺失。
zh_hant: 遺失側邊欄檔案。

# socket.sidebar.custom.openFailed
source: Failed to open custom sidebar pane.
ar: فشل فتح جزء الشريط الجانبي المخصص.
de: Fehler beim Öffnen des benutzerdefinierten Seitenleisten-Teilfensters.
es: Error al abrir el panel de la barra lateral personalizada.
fr: Échec de l'ouverture du volet personnalisé de la barre latérale.
ja: カスタムサイドバーのペインを開けませんでした。
ko: 사용자 지정 사이드바 분할 창을 열지 못했습니다.
zh_hans: 无法打开自定义侧边栏窗格。
zh_hant: 開啟自訂側邊欄窗格失敗。

# socket.sidebar.custom.openInvalidWindowId
source: Missing or invalid window_id
ar: معرّف window_id مفقود أو غير صالح
de: Fehlende oder ungültige window_id
es: window_id faltante o no válido
fr: window_id manquant ou non valide
ja: window_id が指定されていないか無効です
ko: window_id가 없거나 잘못되었습니다
zh_hans: window_id 缺失或无效
zh_hant: 遺失或無效的 window_id

# socket.sidebar.custom.openInvalidWorkspaceId
source: The workspace identifier is missing or invalid
ar: معرّف مساحة العمل مفقود أو غير صالح
de: Die Kennung des Arbeitsbereichs fehlt oder ist ungültig
es: Falta el identificador del espacio de trabajo o no es válido
fr: L’identifiant de l’espace de travail est manquant ou invalide
ja: workspace_id が指定されていないか無効です
ko: 작업 공간 식별자가 누락되었거나 올바르지 않습니다
zh_hans: 工作区标识符缺失或无效
zh_hant: 工作區識別碼遺失或無效

# socket.sidebar.custom.openMissingName
source: Open requires a sidebar name.
ar: يتطلب الفتح اسماً للشريط الجانبي.
de: Das Öffnen erfordert einen Seitenleistennamen.
es: Abrir requiere un nombre de barra lateral.
fr: L'ouverture requiert un nom de barre latérale.
ja: 開くにはサイドバー名が必要です。
ko: 열기에는 사이드바 이름이 필요합니다.
zh_hans: 打开操作需要提供侧边栏名称。
zh_hant: 開啟操作需要側邊欄名稱。

# socket.sidebar.custom.openNoWindow
source: Unable to access the target workspace.
ar: تعذر الوصول إلى مساحة العمل المستهدفة.
de: Auf den Ziel-Arbeitsbereich kann nicht zugegriffen werden.
es: No se puede acceder al espacio de trabajo de destino.
fr: Impossible d'accéder à l'espace de travail cible.
ja: 対象ワークスペースにアクセスできません。
ko: 대상 작업 공간에 액세스할 수 없습니다.
zh_hans: 无法访问目标工作区。
zh_hant: 無法存取目標工作區。

# socket.sidebar.custom.openNoWorkspace
source: Workspace not found.
ar: لم يتم العثور على مساحة العمل.
de: Arbeitsbereich nicht gefunden.
es: Espacio de trabajo no encontrado.
fr: Espace de travail non trouvé.
ja: ワークスペースが見つかりません。
ko: 작업 공간을 찾을 수 없습니다.
zh_hans: 未找到工作区。
zh_hant: 找不到工作區。

# socket.sidebar.custom.selectMissingName
source: Select requires a sidebar name.
ar: يتطلب التحديد اسماً للشريط الجانبي.
de: Das Auswählen erfordert einen Seitenleistennamen.
es: Seleccionar requiere un nombre de barra lateral.
fr: La sélection requiert un nom de barre latérale.
ja: 選択するにはサイドバー名が必要です。
ko: 선택에는 사이드바 이름이 필요합니다.
zh_hans: 选择操作需要提供侧边栏名称。
zh_hant: 選擇操作需要側邊欄名稱。

# socket.surface.create.remoteTmuxPaneUnsupportedType
source: Only terminal surfaces can target a remote tmux pane; the terminal is created as a new tmux window after the pane's window.
ar: يمكن لأسطح الطرفية فقط استهداف جزء tmux بعيد؛ يتم إنشاء الطرفية كنافذة tmux جديدة بعد نافذة الجزء.
de: Nur Terminal-Oberflächen können auf ein Remote-tmux-Teilfenster verweisen; das Terminal wird als neues tmux-Fenster nach dem Fenster des Teilfensters erstellt.
es: Solo las superficies de terminal pueden tener como objetivo un panel tmux remoto; la terminal se crea como una nueva ventana de tmux después de la ventana del panel.
fr: Seules les surfaces d’affichage de terminal peuvent cibler un volet tmux distant ; le terminal est créé en tant que nouvelle fenêtre tmux après la fenêtre du volet.
ja: リモート tmux ペインを対象にできるのはターミナルサーフェスだけです。ターミナルは対象ペインのウインドウの後に新しい tmux ウインドウとして作成されます。
ko: 터미널 화면만 원격 tmux 분할 창을 대상으로 지정할 수 있습니다. 터미널은 분할 창의 창 뒤에 새 tmux 창으로 생성됩니다.
zh_hans: 只有终端表面可以指向远程 tmux 窗格；终端会作为新的 tmux 窗口创建在该窗格所在窗口之后。
zh_hant: 只有終端機介面可以指向遠端 tmux 窗格；終端機將在該窗格的視窗後方建立為新的 tmux 視窗。

# socket.surface.error.surfaceNotFound
source: Surface not found
ar: لم يتم العثور على السطح
bs: Površina nije pronađena
da: Overflade blev ikke fundet
de: Oberfläche nicht gefunden
es: No se encontró la superficie
fr: Surface introuvable
it: Superficie non trovata
ja: サーフェスが見つかりません
ko: 서피스를 찾을 수 없습니다
nb: Fant ikke overflate
pl: Nie znaleziono powierzchni
pt_br: Superfície não encontrada
ru: Поверхность не найдена
th: ไม่พบพื้นผิว
tr: Yüzey bulunamadı
uk: Поверхню не знайдено
zh_hans: 未找到表面
zh_hant: 找不到介面

# socket.surface.resume.agentSessionEndedMustBeBoolean
source: agent_session_ended must be a boolean
ar: يجب أن يكون agent_session_ended قيمة منطقية (boolean)
de: agent_session_ended muss ein Boolean sein
es: agent_session_ended debe ser un booleano
fr: agent_session_ended doit être un booléen
ja: agent_session_ended はブール値である必要があります
ko: agent_session_ended는 boolean 값이어야 합니다
zh_hans: agent_session_ended 必须是布尔值
zh_hant: agent_session_ended 必須是布林值

# socket.surface.resume.launchCommandMustBeValid
source: launch_command.arguments must be a non-empty array of strings
ar: يجب أن يكون launch_command.arguments مصفوفة غير فارغة من النصوص
de: launch_command.arguments muss ein nicht-leeres Array von Strings sein
es: launch_command.arguments debe ser un array de strings no vacío
fr: launch_command.arguments doit être un tableau non vide de chaînes de caractères
ja: launch_command.arguments は空でない文字列の配列である必要があります
ko: launch_command.arguments는 비어 있지 않은 문자열 배열이어야 합니다
zh_hans: launch_command.arguments 必须是非空的字符串数组
zh_hant: launch_command.arguments 必須是包含字串的非空陣列

# socket.surface.resume.restoreClaimMustBeValid
source: Missing or invalid restore claim
ar: طلب الاستعادة مفقود أو غير صالح
de: Fehlender oder ungültiger Wiederherstellungsanspruch
es: Solicitud de restauración faltante o no válida
fr: Demande de restauration manquante ou non valide
ja: 復元要求のクレームがないか無効です
ko: 복원 클레임이 없거나 잘못되었습니다
zh_hans: 恢复凭据缺失或无效
zh_hant: 遺失或無效的 restore claim

# socket.surfaceSplitOff.error.appDelegateUnavailable
source: AppDelegate not available
ar: AppDelegate غير متاح
de: AppDelegate nicht verfügbar
es: AppDelegate no disponible
fr: AppDelegate non disponible
ja: AppDelegateを利用できません
ko: AppDelegate를 사용할 수 없습니다
zh_hans: AppDelegate 不可用
zh_hant: 找不到 AppDelegate

# socket.surfaceSplitOff.error.invalidDirection
source: Missing or invalid direction (left|right|up|down)
ar: الاتجاه مفقود أو غير صالح (left|right|up|down)
de: Fehlende oder ungültige Richtung (left|right|up|down)
es: Dirección faltante o no válida (left|right|up|down)
fr: Direction manquante ou non valide (left|right|up|down)
ja: 方向が指定されていないか無効です（left|right|up|down）
ko: 방향(left|right|up|down)이 없거나 잘못되었습니다
zh_hans: direction 缺失或无效（left|right|up|down）
zh_hant: 遺失或無效的方向 (left|right|up|down)

# socket.surfaceSplitOff.error.invalidWindowId
source: Missing or invalid window_id
ar: معرّف window_id مفقود أو غير صالح
de: Fehlende oder ungültige window_id
es: window_id faltante o no válido
fr: window_id manquant ou non valide
ja: window_idが指定されていないか無効です
ko: window_id가 없거나 잘못되었습니다
zh_hans: window_id 缺失或无效
zh_hant: 遺失或無效的 window_id

# socket.surfaceSplitOff.error.invalidWorkspaceId
source: The workspace identifier is missing or invalid
ar: معرّف مساحة العمل مفقود أو غير صالح
de: Die Kennung des Arbeitsbereichs fehlt oder ist ungültig
es: Falta el identificador del espacio de trabajo o no es válido
fr: L’identifiant de l’espace de travail est manquant ou invalide
ja: workspace_idが指定されていないか無効です
ko: 작업 공간 식별자가 누락되었거나 올바르지 않습니다
zh_hans: 工作区标识符缺失或无效
zh_hant: 工作區識別碼遺失或無效

# socket.surfaceSplitOff.error.missingSurfaceId
source: Missing or invalid surface_id
ar: معرّف surface_id مفقود أو غير صالح
de: Fehlende oder ungültige surface_id
es: surface_id faltante o no válido
fr: surface_id manquant ou invalide
ja: surface_idが指定されていないか無効です
ko: surface_id가 없거나 잘못되었습니다
zh_hans: surface_id 缺失或无效
zh_hant: 遺失或無效的 surface_id

# socket.surfaceSplitOff.error.moveSurfaceFailed
source: Failed to move surface
ar: فشل نقل السطح
de: Fehler beim Verschieben der Oberfläche
es: Error al mover la superficie
fr: Échec du déplacement de la surface d’affichage
ja: サーフェスを移動できませんでした
ko: 화면을 이동하지 못했습니다
zh_hans: 移动表面失败
zh_hant: 移動介面失敗

# socket.surfaceSplitOff.error.sourcePaneNotFound
source: Source pane not found
ar: لم يتم العثور على الجزء المصدر
de: Quell-Teilfenster nicht gefunden
es: Panel de origen no encontrado
fr: Volet source introuvable
ja: 移動元ペインが見つかりません
ko: 소스 분할 창을 찾을 수 없습니다
zh_hans: 未找到源窗格
zh_hant: 找不到來源窗格

# socket.surfaceSplitOff.error.splitPaneFailed
source: Failed to split pane
ar: فشل تقسيم الجزء
de: Fehler beim Aufteilen des Teilfensters
es: Error al dividir el panel
fr: Échec de la division du volet
ja: ペインを分割できませんでした
ko: 분할 창을 분할하지 못했습니다
zh_hans: 拆分窗格失败
zh_hant: 分割窗格失敗

# socket.surfaceSplitOff.error.surfaceNotFound
source: Surface not found
ar: السطح غير موجود
de: Oberfläche nicht gefunden
es: Superficie no encontrada
fr: Surface d’affichage introuvable
ja: サーフェスが見つかりません
ko: 화면을 찾을 수 없습니다
zh_hans: 未找到表面
zh_hant: 找不到介面
